import { extractTrainNameNo } from '../../../models/trainnameno_extractor'

const testExtractTrainNameNoName = '$trainName($trainNo)の号数は$trainNameNo'

const testExtractTrainNameNo = ({ trainName, trainNo, trainNameNo }) => {
    expect(extractTrainNameNo(trainName, trainNo)).toBe(trainNameNo)
}

describe('JR四国特急・快速', () => {
    describe('しおかぜ', () => {
        // 規則: 号数そのまま(Wikipedia)
        test.each`
            trainName     | trainNo  | trainNameNo
            ${'しおかぜ'} | ${'1M'}  | ${'1'}
            ${'しおかぜ'} | ${'2M'}  | ${'2'}
            ${'しおかぜ'} | ${'3M'}  | ${'3'}
            ${'しおかぜ'} | ${'4M'}  | ${'4'}
            ${'しおかぜ'} | ${'5M'}  | ${'5'}
            ${'しおかぜ'} | ${'6M'}  | ${'6'}
            ${'しおかぜ'} | ${'7M'}  | ${'7'}
            ${'しおかぜ'} | ${'8M'}  | ${'8'}
            ${'しおかぜ'} | ${'9M'}  | ${'9'}
            ${'しおかぜ'} | ${'10M'} | ${'10'}
            ${'しおかぜ'} | ${'11M'} | ${'11'}
            ${'しおかぜ'} | ${'12M'} | ${'12'}
            ${'しおかぜ'} | ${'13M'} | ${'13'}
            ${'しおかぜ'} | ${'14M'} | ${'14'}
            ${'しおかぜ'} | ${'15M'} | ${'15'}
            ${'しおかぜ'} | ${'16M'} | ${'16'}
            ${'しおかぜ'} | ${'17M'} | ${'17'}
            ${'しおかぜ'} | ${'18M'} | ${'18'}
            ${'しおかぜ'} | ${'19M'} | ${'19'}
            ${'しおかぜ'} | ${'20M'} | ${'20'}
            ${'しおかぜ'} | ${'21M'} | ${'21'}
            ${'しおかぜ'} | ${'22M'} | ${'22'}
            ${'しおかぜ'} | ${'23M'} | ${'23'}
            ${'しおかぜ'} | ${'24M'} | ${'24'}
            ${'しおかぜ'} | ${'25M'} | ${'25'}
            ${'しおかぜ'} | ${'26M'} | ${'26'}
            ${'しおかぜ'} | ${'27M'} | ${'27'}
            ${'しおかぜ'} | ${'28M'} | ${'28'}
            ${'しおかぜ'} | ${'29M'} | ${'29'}
            ${'しおかぜ'} | ${'30M'} | ${'30'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('いしづち', () => {
        // 規則: しおかぜ併結は号数+1000, 松山側単独運転(100号台)は1040+号数の下1桁(Wikipedia)
        test.each`
            trainName     | trainNo    | trainNameNo
            ${'いしづち'} | ${'1001M'} | ${'1'}
            ${'いしづち'} | ${'1002M'} | ${'2'}
            ${'いしづち'} | ${'1003M'} | ${'3'}
            ${'いしづち'} | ${'1004M'} | ${'4'}
            ${'いしづち'} | ${'1005M'} | ${'5'}
            ${'いしづち'} | ${'1006M'} | ${'6'}
            ${'いしづち'} | ${'1007M'} | ${'7'}
            ${'いしづち'} | ${'1008M'} | ${'8'}
            ${'いしづち'} | ${'1009M'} | ${'9'}
            ${'いしづち'} | ${'1010M'} | ${'10'}
            ${'いしづち'} | ${'1011M'} | ${'11'}
            ${'いしづち'} | ${'1012M'} | ${'12'}
            ${'いしづち'} | ${'1013M'} | ${'13'}
            ${'いしづち'} | ${'1014M'} | ${'14'}
            ${'いしづち'} | ${'1015M'} | ${'15'}
            ${'いしづち'} | ${'1016M'} | ${'16'}
            ${'いしづち'} | ${'1017M'} | ${'17'}
            ${'いしづち'} | ${'1018M'} | ${'18'}
            ${'いしづち'} | ${'1019M'} | ${'19'}
            ${'いしづち'} | ${'1020M'} | ${'20'}
            ${'いしづち'} | ${'1021M'} | ${'21'}
            ${'いしづち'} | ${'1022M'} | ${'22'}
            ${'いしづち'} | ${'1023M'} | ${'23'}
            ${'いしづち'} | ${'1024M'} | ${'24'}
            ${'いしづち'} | ${'1025M'} | ${'25'}
            ${'いしづち'} | ${'1026M'} | ${'26'}
            ${'いしづち'} | ${'1027M'} | ${'27'}
            ${'いしづち'} | ${'1028M'} | ${'28'}
            ${'いしづち'} | ${'1029M'} | ${'29'}
            ${'いしづち'} | ${'1030M'} | ${'30'}
            ${'いしづち'} | ${'1041M'} | ${'101'}
            ${'いしづち'} | ${'1042M'} | ${'102'}
            ${'いしづち'} | ${'1043M'} | ${'103'}
            ${'いしづち'} | ${'1044M'} | ${'104'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('宇和海', () => {
        // 規則: 号数+1050(Wikipedia)
        test.each`
            trainName   | trainNo    | trainNameNo
            ${'宇和海'} | ${'1051D'} | ${'1'}
            ${'宇和海'} | ${'1052D'} | ${'2'}
            ${'宇和海'} | ${'1053D'} | ${'3'}
            ${'宇和海'} | ${'1054D'} | ${'4'}
            ${'宇和海'} | ${'1055D'} | ${'5'}
            ${'宇和海'} | ${'1056D'} | ${'6'}
            ${'宇和海'} | ${'1057D'} | ${'7'}
            ${'宇和海'} | ${'1058D'} | ${'8'}
            ${'宇和海'} | ${'1059D'} | ${'9'}
            ${'宇和海'} | ${'1060D'} | ${'10'}
            ${'宇和海'} | ${'1061D'} | ${'11'}
            ${'宇和海'} | ${'1062D'} | ${'12'}
            ${'宇和海'} | ${'1063D'} | ${'13'}
            ${'宇和海'} | ${'1064D'} | ${'14'}
            ${'宇和海'} | ${'1065D'} | ${'15'}
            ${'宇和海'} | ${'1066D'} | ${'16'}
            ${'宇和海'} | ${'1067D'} | ${'17'}
            ${'宇和海'} | ${'1068D'} | ${'18'}
            ${'宇和海'} | ${'1069D'} | ${'19'}
            ${'宇和海'} | ${'1070D'} | ${'20'}
            ${'宇和海'} | ${'1071D'} | ${'21'}
            ${'宇和海'} | ${'1072D'} | ${'22'}
            ${'宇和海'} | ${'1073D'} | ${'23'}
            ${'宇和海'} | ${'1074D'} | ${'24'}
            ${'宇和海'} | ${'1075D'} | ${'25'}
            ${'宇和海'} | ${'1076D'} | ${'26'}
            ${'宇和海'} | ${'1077D'} | ${'27'}
            ${'宇和海'} | ${'1078D'} | ${'28'}
            ${'宇和海'} | ${'1079D'} | ${'29'}
            ${'宇和海'} | ${'1080D'} | ${'30'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('南風', () => {
        // 規則: 号数+30(Wikipedia)
        test.each`
            trainName | trainNo  | trainNameNo
            ${'南風'} | ${'31D'} | ${'1'}
            ${'南風'} | ${'32D'} | ${'2'}
            ${'南風'} | ${'33D'} | ${'3'}
            ${'南風'} | ${'34D'} | ${'4'}
            ${'南風'} | ${'35D'} | ${'5'}
            ${'南風'} | ${'36D'} | ${'6'}
            ${'南風'} | ${'37D'} | ${'7'}
            ${'南風'} | ${'38D'} | ${'8'}
            ${'南風'} | ${'39D'} | ${'9'}
            ${'南風'} | ${'40D'} | ${'10'}
            ${'南風'} | ${'41D'} | ${'11'}
            ${'南風'} | ${'42D'} | ${'12'}
            ${'南風'} | ${'43D'} | ${'13'}
            ${'南風'} | ${'44D'} | ${'14'}
            ${'南風'} | ${'45D'} | ${'15'}
            ${'南風'} | ${'46D'} | ${'16'}
            ${'南風'} | ${'47D'} | ${'17'}
            ${'南風'} | ${'48D'} | ${'18'}
            ${'南風'} | ${'49D'} | ${'19'}
            ${'南風'} | ${'50D'} | ${'20'}
            ${'南風'} | ${'51D'} | ${'21'}
            ${'南風'} | ${'52D'} | ${'22'}
            ${'南風'} | ${'53D'} | ${'23'}
            ${'南風'} | ${'54D'} | ${'24'}
            ${'南風'} | ${'55D'} | ${'25'}
            ${'南風'} | ${'56D'} | ${'26'}
            ${'南風'} | ${'57D'} | ${'27'}
            ${'南風'} | ${'58D'} | ${'28'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('しまんと', () => {
        // 規則: 号数+2000(Wikipedia)
        test.each`
            trainName     | trainNo    | trainNameNo
            ${'しまんと'} | ${'2001D'} | ${'1'}
            ${'しまんと'} | ${'2002D'} | ${'2'}
            ${'しまんと'} | ${'2003D'} | ${'3'}
            ${'しまんと'} | ${'2004D'} | ${'4'}
            ${'しまんと'} | ${'2005D'} | ${'5'}
            ${'しまんと'} | ${'2006D'} | ${'6'}
            ${'しまんと'} | ${'2007D'} | ${'7'}
            ${'しまんと'} | ${'2008D'} | ${'8'}
            ${'しまんと'} | ${'2009D'} | ${'9'}
            ${'しまんと'} | ${'2010D'} | ${'10'}
            ${'しまんと'} | ${'2011D'} | ${'11'}
            ${'しまんと'} | ${'2012D'} | ${'12'}
            ${'しまんと'} | ${'2013D'} | ${'13'}
            ${'しまんと'} | ${'2014D'} | ${'14'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('あしずり', () => {
        // 規則: 号数+2070(Wikipedia)
        test.each`
            trainName     | trainNo    | trainNameNo
            ${'あしずり'} | ${'2071D'} | ${'1'}
            ${'あしずり'} | ${'2072D'} | ${'2'}
            ${'あしずり'} | ${'2073D'} | ${'3'}
            ${'あしずり'} | ${'2074D'} | ${'4'}
            ${'あしずり'} | ${'2075D'} | ${'5'}
            ${'あしずり'} | ${'2076D'} | ${'6'}
            ${'あしずり'} | ${'2077D'} | ${'7'}
            ${'あしずり'} | ${'2078D'} | ${'8'}
            ${'あしずり'} | ${'2079D'} | ${'9'}
            ${'あしずり'} | ${'2080D'} | ${'10'}
            ${'あしずり'} | ${'2081D'} | ${'11'}
            ${'あしずり'} | ${'2082D'} | ${'12'}
            ${'あしずり'} | ${'2083D'} | ${'13'}
            ${'あしずり'} | ${'2084D'} | ${'14'}
            ${'あしずり'} | ${'2085D'} | ${'15'}
            ${'あしずり'} | ${'2086D'} | ${'16'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('うずしお', () => {
        // 規則: 号数+3000(Wikipedia)
        test.each`
            trainName     | trainNo    | trainNameNo
            ${'うずしお'} | ${'3001D'} | ${'1'}
            ${'うずしお'} | ${'3002D'} | ${'2'}
            ${'うずしお'} | ${'3003D'} | ${'3'}
            ${'うずしお'} | ${'3004D'} | ${'4'}
            ${'うずしお'} | ${'3005D'} | ${'5'}
            ${'うずしお'} | ${'3006D'} | ${'6'}
            ${'うずしお'} | ${'3007D'} | ${'7'}
            ${'うずしお'} | ${'3008D'} | ${'8'}
            ${'うずしお'} | ${'3009D'} | ${'9'}
            ${'うずしお'} | ${'3010D'} | ${'10'}
            ${'うずしお'} | ${'3011D'} | ${'11'}
            ${'うずしお'} | ${'3012D'} | ${'12'}
            ${'うずしお'} | ${'3013D'} | ${'13'}
            ${'うずしお'} | ${'3014D'} | ${'14'}
            ${'うずしお'} | ${'3015D'} | ${'15'}
            ${'うずしお'} | ${'3016D'} | ${'16'}
            ${'うずしお'} | ${'3017D'} | ${'17'}
            ${'うずしお'} | ${'3018D'} | ${'18'}
            ${'うずしお'} | ${'3019D'} | ${'19'}
            ${'うずしお'} | ${'3020D'} | ${'20'}
            ${'うずしお'} | ${'3021D'} | ${'21'}
            ${'うずしお'} | ${'3022D'} | ${'22'}
            ${'うずしお'} | ${'3023D'} | ${'23'}
            ${'うずしお'} | ${'3024D'} | ${'24'}
            ${'うずしお'} | ${'3025D'} | ${'25'}
            ${'うずしお'} | ${'3026D'} | ${'26'}
            ${'うずしお'} | ${'3027D'} | ${'27'}
            ${'うずしお'} | ${'3028D'} | ${'28'}
            ${'うずしお'} | ${'3029D'} | ${'29'}
            ${'うずしお'} | ${'3030D'} | ${'30'}
            ${'うずしお'} | ${'3031D'} | ${'31'}
            ${'うずしお'} | ${'3032D'} | ${'32'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('剣山', () => {
        // 規則: 号数+4000(Wikipedia)
        test.each`
            trainName | trainNo    | trainNameNo
            ${'剣山'} | ${'4001D'} | ${'1'}
            ${'剣山'} | ${'4002D'} | ${'2'}
            ${'剣山'} | ${'4003D'} | ${'3'}
            ${'剣山'} | ${'4004D'} | ${'4'}
            ${'剣山'} | ${'4005D'} | ${'5'}
            ${'剣山'} | ${'4006D'} | ${'6'}
            ${'剣山'} | ${'4007D'} | ${'7'}
            ${'剣山'} | ${'4008D'} | ${'8'}
            ${'剣山'} | ${'4009D'} | ${'9'}
            ${'剣山'} | ${'4010D'} | ${'10'}
            ${'剣山'} | ${'4011D'} | ${'11'}
            ${'剣山'} | ${'4012D'} | ${'12'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('むろと', () => {
        // 規則: 号数+8050(Wikipedia)
        test.each`
            trainName   | trainNo    | trainNameNo
            ${'むろと'} | ${'8051D'} | ${'1'}
            ${'むろと'} | ${'8052D'} | ${'2'}
            ${'むろと'} | ${'8053D'} | ${'3'}
            ${'むろと'} | ${'8054D'} | ${'4'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })

    describe('マリンライナー', () => {
        // 規則: 号数+3100(Wikipedia)
        test.each`
            trainName           | trainNo    | trainNameNo
            ${'マリンライナー'} | ${'3101M'} | ${'1'}
            ${'マリンライナー'} | ${'3102M'} | ${'2'}
            ${'マリンライナー'} | ${'3103M'} | ${'3'}
            ${'マリンライナー'} | ${'3104M'} | ${'4'}
            ${'マリンライナー'} | ${'3105M'} | ${'5'}
            ${'マリンライナー'} | ${'3106M'} | ${'6'}
            ${'マリンライナー'} | ${'3107M'} | ${'7'}
            ${'マリンライナー'} | ${'3108M'} | ${'8'}
            ${'マリンライナー'} | ${'3109M'} | ${'9'}
            ${'マリンライナー'} | ${'3110M'} | ${'10'}
            ${'マリンライナー'} | ${'3111M'} | ${'11'}
            ${'マリンライナー'} | ${'3112M'} | ${'12'}
            ${'マリンライナー'} | ${'3113M'} | ${'13'}
            ${'マリンライナー'} | ${'3114M'} | ${'14'}
            ${'マリンライナー'} | ${'3115M'} | ${'15'}
            ${'マリンライナー'} | ${'3116M'} | ${'16'}
            ${'マリンライナー'} | ${'3117M'} | ${'17'}
            ${'マリンライナー'} | ${'3118M'} | ${'18'}
            ${'マリンライナー'} | ${'3119M'} | ${'19'}
            ${'マリンライナー'} | ${'3120M'} | ${'20'}
            ${'マリンライナー'} | ${'3121M'} | ${'21'}
            ${'マリンライナー'} | ${'3122M'} | ${'22'}
            ${'マリンライナー'} | ${'3123M'} | ${'23'}
            ${'マリンライナー'} | ${'3124M'} | ${'24'}
            ${'マリンライナー'} | ${'3125M'} | ${'25'}
            ${'マリンライナー'} | ${'3126M'} | ${'26'}
            ${'マリンライナー'} | ${'3127M'} | ${'27'}
            ${'マリンライナー'} | ${'3128M'} | ${'28'}
            ${'マリンライナー'} | ${'3129M'} | ${'29'}
            ${'マリンライナー'} | ${'3130M'} | ${'30'}
            ${'マリンライナー'} | ${'3131M'} | ${'31'}
            ${'マリンライナー'} | ${'3132M'} | ${'32'}
            ${'マリンライナー'} | ${'3133M'} | ${'33'}
            ${'マリンライナー'} | ${'3134M'} | ${'34'}
            ${'マリンライナー'} | ${'3135M'} | ${'35'}
            ${'マリンライナー'} | ${'3136M'} | ${'36'}
            ${'マリンライナー'} | ${'3137M'} | ${'37'}
            ${'マリンライナー'} | ${'3138M'} | ${'38'}
            ${'マリンライナー'} | ${'3139M'} | ${'39'}
            ${'マリンライナー'} | ${'3140M'} | ${'40'}
            ${'マリンライナー'} | ${'3141M'} | ${'41'}
            ${'マリンライナー'} | ${'3142M'} | ${'42'}
            ${'マリンライナー'} | ${'3143M'} | ${'43'}
            ${'マリンライナー'} | ${'3144M'} | ${'44'}
            ${'マリンライナー'} | ${'3145M'} | ${'45'}
            ${'マリンライナー'} | ${'3146M'} | ${'46'}
            ${'マリンライナー'} | ${'3147M'} | ${'47'}
            ${'マリンライナー'} | ${'3148M'} | ${'48'}
            ${'マリンライナー'} | ${'3149M'} | ${'49'}
            ${'マリンライナー'} | ${'3150M'} | ${'50'}
            ${'マリンライナー'} | ${'3151M'} | ${'51'}
            ${'マリンライナー'} | ${'3152M'} | ${'52'}
            ${'マリンライナー'} | ${'3153M'} | ${'53'}
            ${'マリンライナー'} | ${'3154M'} | ${'54'}
            ${'マリンライナー'} | ${'3155M'} | ${'55'}
            ${'マリンライナー'} | ${'3156M'} | ${'56'}
            ${'マリンライナー'} | ${'3157M'} | ${'57'}
            ${'マリンライナー'} | ${'3158M'} | ${'58'}
            ${'マリンライナー'} | ${'3159M'} | ${'59'}
            ${'マリンライナー'} | ${'3160M'} | ${'60'}
            ${'マリンライナー'} | ${'3161M'} | ${'61'}
            ${'マリンライナー'} | ${'3162M'} | ${'62'}
            ${'マリンライナー'} | ${'3163M'} | ${'63'}
            ${'マリンライナー'} | ${'3164M'} | ${'64'}
            ${'マリンライナー'} | ${'3165M'} | ${'65'}
            ${'マリンライナー'} | ${'3166M'} | ${'66'}
            ${'マリンライナー'} | ${'3167M'} | ${'67'}
            ${'マリンライナー'} | ${'3168M'} | ${'68'}
            ${'マリンライナー'} | ${'3169M'} | ${'69'}
            ${'マリンライナー'} | ${'3170M'} | ${'70'}
        `(testExtractTrainNameNoName, testExtractTrainNameNo)
    })
})
